Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Sets the position of the mouse on the display to the indicated values.
zh_cn: 设置显示器上的鼠标位置为指定值。

source: Sets the position of the window inside the browser/visible area of the screen.
zh_cn: 设置浏览器内或者屏幕的可见区域内的窗口位置。

source: Sets the size of the window in pixels.
zh_cn: 设置窗口的大小，以像素为单位。

source: Sets the standard cursor for the game window.
zh_cn: 设置游戏窗口的普通光标。

source: Sets whether the game is run in fullscreen or not.
zh_cn: 设置游戏是否全屏运行或者窗口运行。

source: Setting the values in this way will also set the draw position to the (0,0) of the display or game window, so you can provide offset values to "move" the (0,0) position:
zh_cn: 用这种方式设置的值也包括在显示器或游戏窗口中GUI绘制的位置，可以通过提供一对偏移值去“移动或改变”这个(0,0)位置。

source: Shaders
zh_cn: 着色器

source: Should you get other modules at a later date, the YYC will update too and show an extra (YYC) module for that target platform.
zh_cn: 以后其他模块更新了，YYC也将更新，并为目标平台显示一个额外的 (YYC) 的模块。

source: Should you need more control, you should use the function screen_save_part.
zh_cn: 如果需要更多的控制，应该使用这个函数screen_save_part。

source: Should you need to see all instances that are currently in the room, you can select this window and they will be listed.
zh_cn: 如果你需要监视所有的当前房间中的实例，你可以选择这个窗口，它们就会被列出来。

source: Should you wish to upgrade your current version of GameMaker: Studio, you can do so through the YoYo Games web site or, if you have the Steam Client, by right clicking on the GameMaker: Studio entry in the Library and selecting "View Downloadable Content".
zh_cn: 如果你想升级你当前版本的 iGameMaker: Studio，你可以访问 YoYo Games 网站，如果你有 Steam 客户端，右键点击 GameMaker: Studio 进入选项选择 "View Downloadable Content (查看下载内容)"。

source: Similar to the above, this command collapses a resource tree section or sub-folder.
zh_cn: 折叠资源树的每一个节点。

source: Similarly, you can subtract it using -=, multiply it using *=, divide it using /=, or use bitwise operators using |=, &=, or ^=.
zh_cn: 类似地，也可以用 -=实现自减，使用 *=自乘，使用 /=自除，或者也可以使用位运算符 |=、 &=和 ^=。

source: Simply calling the function with no arguments will set the GUI layer to be drawn at the (0,0) position of the screen or game window, with the width and height being scaled to fit the whole area.
zh_cn: 简单的无参数调用这个函数，GUI层将被绘制在屏幕或窗口的(0,0)位置，宽度和高度将被拉伸适应整个区域。

source: Since arrays are numbered consecutively, this means you can loop through them to perform extra actions too, like we did to initialize it:
zh_cn: 另外因为数组的数据是连续的，所以我们可以使用循环来调用数组，就如同数组的初始化：

source: Since not all target devices are the same, some may not support 8x or 4x anti-aliasing for example, and so there is a read only variable available for getting the different levels of AA that the device running the game can display:
zh_cn: 目标设备各有不同，比如一些可能不支持8x 或者 4x抗锯齿， 所以也有一个 只读用来获取设备运行游戏时可以显示的AA（抗锯齿）等级。

source: Size of horizontal border for view following.
zh_cn: 视野跟随的水平边界尺寸。

source: Size of vertical border for view following.
zh_cn: 视野跟随的纵向边界尺寸。

source: So for only 2xAA, this will report 2, for 2x and 4x availability it will report 6.
zh_cn: 所以只支持 2xAA（2倍的AA）会输出2，对于 2x 和 4x（2倍或4倍） 的可用性将输出6。

source: So if you have, for example, the iOS and Android modules, then you will see two new modules added to your target list apart from the standard ones - iOS (YYC) and Android (YYC).
zh_cn: 所以，如果你有 iOS 和 Android 的模块，然后又获得了YYC，你会看到新的模块已经添加到您的目标平台列表 - iOS (YYC) 和 Android (YYC)。

source: So press this to exit GameMaker: Studio.
zh_cn: 所以按这个按钮可以退出 GameMaker: Studio。

source: So the above should be written as either this:
zh_cn: 所以，上面的应该这样写：

source: So there can be at most 16 arguments passed through to a script when called from code, and if you are using the script D'n'D action then only the first 5 arguments can be specified.
zh_cn: 所以代码中调用的时候最多可以传递16个参数，如果使用脚本D'n'D动作，只能指定前面的5个参数。

source: So use this functionality with care!
zh_cn: 所以请谨慎使用此功能 ！

source: So when (for example) you are using view[0] and view[1] in your game room, the draw event for ALL instances will be run twice, once for each view, and with this variable you can check to see what view is currently being drawn.
zh_cn: 所以当（比如）你在游戏房间中使用view[0] 和 view[1]，所有实例的绘制事件将运行两次，每个视野一次，通过这个变量可以检测出当前正在绘制哪个视野。

source: So when we talk about something affecting or changing an instance, we mean that one particular copy of an object in a room is being affected while all the rest are not, but when we talk about affecting or changing an object we mean that anything we do to it will be reflected in all the instances created from that point on too.
zh_cn: 所以当我们讨论改变实例，只是讨论这一个拷贝而其余的实例并不受影响。但是当我们讨论改变物体的时候，那么房间里的所有相关实例均会受到影响。

source: So you can have four instances of the same object, yet each one can be made to have some different properties thanks to this code.
zh_cn: 当同一个物体有四个实例，通过这个代码可以给他们添加不同的属性。

source: So you would like to create a stand-alone application or package of your game, or upload it as HTML5 to a site on the internet so that everyone can play it!
zh_cn: 所以你想创建一个独立的应用程序或把你的游戏打包，或者上传到互联网作为 HTML5 的网站给大家玩！

source: So, for example, in a windows game they will be bundled within the *.exe and exported when run, or in HTML5 they will be included in the html5_game folder and stored on the server.
zh_cn: 举例来说，在生成 windows 平台游戏时这些文件会被打包进 *.exe 文件中并且在运行时被解包出来，而在 HTML5 平台这些文件会被包含在 html5_game 文件夹中并且储存在服务器上。

source: So, if you find something you think is a bug, then please use this link and report it to us and we'll do our very best to fix it.
zh_cn: 所以，如果你找到你认为是 bug 的东西，请点击 该链接 报告错误，我们会竭尽所能修复它。

source: So, if you have two different view ports at two different positions, the total area that they cover defines the size of the game window.
zh_cn: 所以，如果有两个不同的视口在两个不同的位置，覆盖的总面积定义游戏窗口的大小。

source: So, the above script would be called like this:
zh_cn: 所以，上面的脚本这样使用：

source: So, the code would look something like this:
zh_cn: 因此，代码可以这样写：

source: So, the object is the template for the instance, and the instance is what we place in a room to make our game.
zh_cn: 所以， 物体可以说是实例的模板，而实例就是我们制作游戏时放在房间里的具体实例。

source: So, to use different fonts that you have on your computer you must create a font resource in GameMaker: Studio.
zh_cn: 为了使用不同的字体，你需要在电脑上使用 GameMaker: Studio 创建一个字体资源。

source: So, with that done, we would then have this in the main Draw event:
zh_cn: 接着，那个完成之后，我们需要在主要的Draw 事件中做这些事件：

source: So, you would have your "main" canvas, and then your secondary surface canvas elements, which will be assigned using this function to the correct surfaces.
zh_cn: 所以，你会有一个“主”画布，然后是辅助的表面层canvas元素，通过这个函数指定到正确的表面层。

source: Social Gaming
zh_cn: 社会化模块

source: Solid
zh_cn: 固体

source: Some functions return values and can be used in expressions, while others simply execute commands and you should note that it is impossible to use a function as the left-hand side of an assignment.
zh_cn: 某些函数有返回值可以用在表达式中，而其它的只是简单的运行命令，注意不要将函数用在一个赋值的左手边。

source: Some objects, like walls, just sit there and don’t do anything, while other objects, like the main player controlled character, will move around and react to the input received from the player using keyboard, mouse, or joystick.
zh_cn: 一些物体例如墙只是在那儿不动，而其他物体例如主角可以在按下鼠标键盘或操纵杆时移动。

source: Something to note about views and view ports is that the total area of the bounding box for all active view ports in the first room of the game is what defines the background canvas size (or window size for MacOS, Ubuntu (Linux) and Windows), as illustrated by the image below: Finally, you should take care when using multiple views as the draw event for all instances is called once for each view, so if you have three views active in one room, the draw event will be run three times every step (basically doing three times the work) which can be a cause for slowdown if the game is large or complex.
zh_cn: 关于视野和视口需要注意的是，游戏第一个房间所有活动视口边框总面积 ，便是定义背景画布大小的东西（或者MacOS、Ubuntu（Linux）和Windows的窗口大小），参考下图的说明： 最后，你应该注意多个视野的情况，因为对于 所有实例的绘制事件，每次视野都会调用一次，如果你一个房间有三个活动视野，绘制事件每步都会运行三次（基本上是三倍的运行量），如果游戏太而复杂，这会导致游戏运行速度减慢。

source: Soon you will become a master GameMaker yourself.
zh_cn: 不久您就可以成为游戏制作大师，

source: Sounds And Music
zh_cn: 声音和音乐

source: Source
zh_cn: Source（源代码）

source: Source Control
zh_cn: 源代码控制

source: Source Control for working in teams using Subversion
zh_cn: 用 Subversion 为团队工作提供源控制

source: Sprites are generally the visual representations of objects within the game you are creating.
zh_cn: 精灵一般是物体的可视化外形。

source: Starting on the left, there is some general information about the object, then in the middle there is the list of events (moments in time) for the object and the window to place the actions that are to be performed in those events, and finally on the right there are the actions themselves which you can select for the object to perform, grouped under different tabs for ease of use.
zh_cn: 首先是左侧，是一些关于这个物体的信息，然后中间的列表是 events (事件)，右边是动作，最右边的是可以拖拽的预定义动作，这些预定义动作被归类在不同的选项卡中。

source: Statement2 is the "step" statement that goes to the next loop evaluation.
zh_cn: 表达式2是“步”语句，递进一个值进入下一个循环。

source: Statements should be separated with a ';' symbol to prevent errors with variable declarations and to keep your code clean and tidy, and can consist of variable declarations, expressions and calls to specific functions or scripts.
zh_cn: 语句之间用“;” （英文分号）隔开，以避免变量声明时出错，并且能让你的代码清晰、轻巧，语句的种类包括： 变量声明、表达式、函数调用等。

source: Status Value
zh_cn: Status 的值

source: Steam Player
zh_cn: Steam 播放器

source: Steam Workshop
zh_cn: Steam 创意工坊

source: Stepping over is useful when you have large scripts to run through, as clicking this will run the whole script or code block as a single step and stop on the next line afterwards, while stepping out will take you out of a script (they will run, but all at once) and stop on the next step.
zh_cn: 跳过代码在你有大片脚本需要运行的时候非常有用，点击它的话会把你的整片脚本或者代码块作为简单的一步来运行，停在随后的下一行；而跳出代码则会把你带出这段脚本（这些脚本一次性全部运行）然后停在下一步。

source: Streaming
zh_cn: 流

source: Streaming is ideal for music as it reduces the one off overhead of uncompressing the whole file, which may cause a pause in the game, but is not recommended for simple sound effects where the hit on the CPU is much less.
zh_cn: 流媒体是最理想的，因为他减少了一次性解压整个文件的开销(可能会导致游戏暂停)，但是不推荐用于 CPU 消耗较小的简单音效。

source: Strings
zh_cn: 字符串

source: Strings and arrays do not permit this option, and it is worth noting that even if a data structure is stored in an instance variable, its ID number is global, so if you have four instances and each one creates a ds_list (for example), each list will have an id from 0 to 3, and they won't all be 0.
zh_cn: 字符串和数组不允许该操作，即使数据结构存储在实例变量中也不值得如此，它的ID是全局的，所以例如如果你有四个实例，每个都生成一个ds_list（列表数据结构），它们的列表ID会是0到3，而不会都为0。

source: Such background images can be created in GameMaker: Studio with its own editor, or you can load them into the resources from files.
zh_cn: 这样的背景图像可以在 GameMaker: Studio 里自己编辑，或者从其他文件里加载资源。

source: Such images are called sprites.
zh_cn: 这样的图像被称为 精灵。

source: Summary
zh_cn: 总结

source: Surfaces
zh_cn: 表面层

source: Surfaces are volatile meaning that they could be removed from memory at any time due to OS memory management and other things, so here we check to see if our surface exists and if it doesn't we create it and assign it to the view 0.
zh_cn: 表面是 不稳定的，意味着系统内存的管理或其它原因，它们可能会从内存中销毁，所以这里检测表面是否存在，如不存在则创建它，并指定给一个视野。

source: Surfaces are always held in texture memory which means that they can be destroyed from one moment to the next (for example, when a screensaver starts on windows, or when minimised on an Android device), so you should always check that a surface exists before doing anything with it (this includes drawing it to the screen).
zh_cn: 表面一直保存在显存里，这意味着从这一刻到另一刻（比如，电脑启动屏幕时，或者安卓设备最小化时），它可能会被破坏，所以在做与表面图层相关的操作之前，你一直都需要检测是否存在一个表面层（包括向屏幕绘制表面时）。

source: Surfaces take up space in memory and so need to be removed, normally at the end of a room, but it can be done at any time depending on the use you put them to.
zh_cn: 表面图层会占据内存空间，通常需要在房间结束工作时清除它们，可以在任何时间执行这个过程，取决于你使用的方式。

source: Surfaces/Textures
zh_cn: Surfaces（表面）/Textures（材质）

source: Switching it off will switch off all aspect ratio correction, as set in the Global Game Settings for the target platform.
zh_cn: 关闭后，长宽比校正也会关闭，这一项在全局游戏设置相关的目标平台中设置。

source: Switching v-sync on may give a smoother gaming experience but it will also need more processing power and so its impact must be considered careful before use, and the same goes for the anti-aliasing where the higher the number the more processing that is required.
zh_cn: 开启 v-sync （垂直同步）画面上可以得到更平滑的游戏体验，但是也需要更多的计算资源，因些使用前仔细考虑它的影响，同理，抗锯齿等级越高，需要的处理资源也更多。

source: Synchronise the game with the cloud service.
zh_cn: 同步您的游戏数据到云端服务器上。

source: Syntax:
zh_cn: 语法：

source: Tapping the notification will start the game on the device and trigger an Asynchronous Push Notification event with a ds_map which can then be parsed to check the payload string and perform whatever action is required.
zh_cn: 点击通知将会启动游戏同时触发 异步推送通知（Asynchronous Push Notification）事件并返回 ds_map ，检查扩展数据的字符串来采取你想要的动作处理这个事件。

source: Target Options
zh_cn: 目标选项

source: Target Platform Formats
zh_cn: 目标平台格式

source: Tells you if the game is running in debug mode or not.
zh_cn: 告诉你 if the game is running in debug mode or not.

source: Texture Group Control for optimising your games and apps
zh_cn: 用纹理组控制优化你的游戏和软件

source: Thankfully the GameMaker Language comes equipped with mechanisms to achieve this.
zh_cn: 幸好GML语言有方法可以实现这个。

source: That "something" can be as simple as adding 2 and 2 to get 4, or as complex as making an enemy run away when their health gets below a certain value.
zh_cn: “某种功能”可以简单到2加2等于4，或者复杂到“当敌人血量低于一定值就逃跑”。

source: That covers the two most important things in GameMaker: Studio, but there are a few more!
zh_cn: 这是GameMaker: Studio 里最重要的两个东西，但是还有一些其他的！

source: That is why GameMaker: Studio gives you the ability to create scripts.
zh_cn: 这也是为什么 GameMaker: Studio提供了创建脚本的功能。

source: That looks pretty good, eh?
zh_cn: 是不是看起来不错？

source: That short code will now spawn a random enemy in the game room, and it uses far less code than an "if / then / else" structure or even a "switch", and as the array is initialized all together in the create event it is MUCH easier to edit and change any of those values as they are not hard-coded into the rest of the object codes.
zh_cn: 上面简短的代码将在游戏房间内产生随机的敌人，这比“if / then / else”结构甚至“switch”结构使用的代码更少。并且由于是统一写在创建事件中，编辑修改起来也更方便。

source: That's just the tip of the iceberg as arrays are one of the most fundamental and useful programming tools you can use, and you'd be surprised at the applications they can have!
zh_cn: 这些只是冰山一角，数组是你可以使用的最基础的编程工具之一，他们能应用的地方会让你惊讶。

source: That's why we have the time line resource.
zh_cn: 这正是为什么我们提供了时间轴资源。

source: The "Workshop" button will open up the Steam Workshop for you in your default browser, while the "Back" button will take you back to the main start-up screen where you can choose to start GameMaker: Studio, or restart the player again (this button is only available when the player has been launched from the splash screen and not from GameMaker: Studio).
zh_cn: "Workshop" 按钮将会用默认浏览器打开 Steam Workshop，而 ""Back" 按钮会让你回到 用户图形界面 你可以选择运行 GameMaker: Studio 或再次打开播放器 (这个按钮只在播放器运行时显示而 不是 在 GameMaker: Studio 里)。

source: The "Break" Statement
zh_cn: break 语句

source: The "Continue" Statement
zh_cn: continue 语句

source: The "Do" Statement
zh_cn: do 语句

source: The "Exit" Statement
zh_cn: exit 语句

source: The "For" Statement
zh_cn: for 语句

source: The "If" Statement
zh_cn: if 语句

source: The "Repeat" Statement
zh_cn: repeat 语句

source: The "Switch" Statement
zh_cn: switch 语句

source: The "While" Statement
zh_cn: while 语句

source: The "With" Construction
zh_cn: with 结构

source: The "break" is used to end prematurely a for, repeat, while, do... until loop of some kind, or to tell a switch statement to end at that point, or to prematurely end a with function.
zh_cn: “break”用于提前结束一个 for、 repeat、 while、 do... until 循环，或者告诉一个 switch语句在某一点结束，或者提前退出 with 函数（with也是一种循环）。

source: The "fire_time" is the date/time that the notification should be pushed to the user device (you can use the GameMaker: Studio Date and Time Functions to get this), and you can give the notification a title and a message text as well as a payload string which will be passed to your game when the users taps the notification.
zh_cn: "fire_time" 是通知应该被推送到玩家设备的时间日期 (你可以使用 GameMaker: Studio 日期和时间函数来取到), 你可以给通知设置标题正文以及当玩家点击通知时发送给游戏程序的扩展字符串。

source: The "window" is where GameMaker: Studio displays your game, and, depending on the target device, there are different things that can be done with it, like set it to fullscreen or not (for example).
zh_cn: 窗口是 GameMaker: Studio 显示游戏的界面，并且取决于不同的目标设备，可以进行不同的操作，比如设置全屏或者窗口模式。

source: The view_current variable can be used to help limit these draw calls however.
zh_cn: 不过， view_current 变量可以用来限制绘制的调用。

source: The All range from 0 till 255
zh_cn: All 全部范围表示从 0 到 255

source: The Debug Module is a powerful tool for checking your game, and is especially useful for tracking down errors and bugs in your code, as well as checking that scripts are run when they should be, and that variables and arrays contain the values you expect etc...
zh_cn: 调试模块 是一个强有力的用来检查你的游戏的工具，并且在追踪你的代码中的错误与bug上尤其有用、同时检查脚本是否如预期那般运行、以及变量和数组包含你期望的数值等等……

source: The Digits range that only contains the 10 digits
zh_cn: Digits 数字范围只包含了10个数字字符

source: The Lettersrange that contains all uppercase and lowercase letters only
zh_cn: Letters 字母范围只包含了全部的大写和小写英文字母

source: The Normal range from 32 till 127
zh_cn: Normal 一般范围表示从 32 到 127

source: The Professional version of GameMaker: Studio comes with the Windows 8 Native and JavaScript target platforms as additional targets for free.
zh_cn: 专业版 GameMaker: Studio 带有 Windows 8 本地和 JavaScript 目标平台作为额外的目标窗口。

source: The Target Options panel is where you set the conversion rates for your game.
zh_cn: Target Options 面板设置转换率。

source: The instance id is the unique identifying number that is given to each and every instance created in your game.
zh_cn: 实例的“id”是你游戏中每一个创建的实例的被给定的唯一的识别码。

source: The GameMaker: Studio IDE (integrated development environment) has a number of advanced options that are of great importance if you wish to get the most out of the product.
zh_cn: 如果你想把游戏的功能做得更全面， GameMaker: Studio IDE (集成开发环境) 有一些高级的设置将非常重要。

source: The GameMaker: Studio iOS module requires that you have a Mac computer (or at least access to one) and that it meets the minimum requirements for the MacOSX target module (see above) and you must be a registered Apple developer and have all certificates and licenses up to date.
zh_cn: GameMaker: Studio iOS 模块需要您有一台 Mac 电脑 (或至少使用一台) 并且符合 MacOSX 的最低标准 (如上)。您必须注册苹果开发者并将所有证书和许可更新。

source: The GameMaker: Studio programming language, GML, gives you much more flexibility and control than the standard actions that are available through the Drag'n'Drop interface.
zh_cn: GameMaker: Studio 编程语言，也就是 GML相当的灵活，是拖拽按钮（Dnd）所不及的。pb

source: The GameMaker: Studio Windows 8 export target will create an app specifically for the Windows 8 OS, and it will be compatible with many of the unique features that this OS offers the user.
zh_cn: GameMaker: Studio可以生成专门为 Windows 8 准备的应用程序，并且为了兼容提供了许多特别的功能。

source: The GameMaker: Studio window will be hidden while you edit the sound and returns when you close the sound editor (you must save the sound in the editor first otherwise it will not be saved in GameMaker: Studio).
zh_cn: GameMaker: Studio 窗口会自动隐藏，关闭编辑器就会返回 (你必须在编辑器里保存好音频文件而不是 GameMaker: Studio 里)。

source: The ds_map ID to use.
zh_cn: ds_map 的ID 。

source: The Android module enables you to create and distribute *.apk files
zh_cn: 安卓模块允许您创建和发布 *.apk(Android安装包) 文件 The Android module enables you to create and distribute *.apk files

source: The Application Surface
zh_cn: 应用表面层

source: The Compile Target
zh_cn: 编译目标

source: The Display, Windows And Views
zh_cn: 显示器、窗口及视野

source: The Drop Down Menus
zh_cn: 下拉菜单

source: The Edit Menu
zh_cn: 编辑菜单

source: The File Menu
zh_cn: 文件菜单

source: The GUI
zh_cn: 用户图形界面 (GUI)

source: The Game Window
zh_cn: 游戏窗口

source: The GameMaker: Player
zh_cn: GameMaker: Player 应用

source: The GameMaker: Studio runner will only work with Android 2.3(Gingerbread) and above (API Level 9 and above in the Android SDK), which covers the majority of devices around at the moment but not all of them, so please check and make sure which version of Android your device uses.
zh_cn: GameMaker: Studio 制作的游戏仅能运行在 Android 2.3 (Gingerbread) 及其以上版本 (API Level 9 以上的Android SDK)，涵盖了目前大多数设备，但不是所有设备。所以请确认您使用的 Android 版本。

source: The Global idea
zh_cn: 全局观

source: The Globals window will show a list of all the currently declared global variables and their values.
zh_cn: Globals窗口会显示一个包含所有当前声明过的全局变量与他们的值的列表。

source: The Graph window shows you a graphic display of how your game is performing.
zh_cn: 图表窗口将你的游戏表现以图表形式展现。

source: The Graphical User Interface
zh_cn: 图形用户界面

source: The Graphical User Interface (GUI)
zh_cn: 用户图形界面 (GUI)

source: The HTML5 export module requires only an HTML5 compliant browser.
zh_cn: HTML5 扩展模块只需要一个支持 HTML5 的浏览器。

source: The HTML5 module enables you to produce ready-to-run HTML and JavaScript code that you can host or embed on any website
zh_cn: HTML5 模块允许您生成可在任何网站嵌入或在自己的主机上的可执行的HTML和JavaScript代码

source: The Help Menu
zh_cn: 帮助菜单

source: The ID of surface to be copied.
zh_cn: 被复制的表面层的ID。

source: The ID of the notification to cancel.
zh_cn: 被取消的通知的 ID 。

source: The ID of the surface to be copied.
zh_cn: 被复制的表面层的ID。

source: The ID of the surface to change.
zh_cn: 即将发生变化的表面层的ID。

source: The ID of the surface to check.
zh_cn: 检测的表面层索引。

source: The ID of the surface to copy the other surface to.
zh_cn: 从其它表面复制到的目的表面层的ID。

source: The ID of the surface to get the height of.
zh_cn: 将要获取高度的表面层ID。

source: The ID of the surface to get the width of.
zh_cn: 即将获取纹理的表面层ID。

source: The ID of the surface to set as the drawing target.
zh_cn: 作为绘制目标的表面层的ID。

source: The ID of the surface to use.
zh_cn: 使用的表面ID。

source: The ID of the surface.
zh_cn: 表面层的ID。

source: The Linux module is designed to be compatible with the Ubuntu operating system, and although it should work with other Linux systems, it is only guaranteed to work with the latest versions of this popular Linux OS.
zh_cn: Linux 模块用于创建 Ubuntu 操作系统程序，尽管它也可以运行在其他 Linux 系统中，但是建议运行在最新最流行的Ubuntu Linux 操作系统中。

source: The Linux module permits you to make desktop games that run on the Ubuntu operating system
zh_cn: Linux 模块允许您制作Ubuntu操作系统的桌面游戏

source: The Locals window shows the current step properties, which includes the name of the current event (or script) being run, the position within the event (PC is "program counter"), the "self" instance running the code block, and the "other" instance in the event.
zh_cn: Locals窗口显示当前步下的性能与参数，包括了当前运行的事件（或者脚本）的名称、事件中的位置（PC就是“程序计数器”）、运行代码块的“self”实例和事件中的“other”实例。

source: The Main Menus
zh_cn: 主菜单

source: The Marketplace Menu
zh_cn: 市场菜单

source: The Mouse Event
zh_cn: 鼠标事件

source: The Player Menu
zh_cn: 播放器菜单

source: The Resource Tree
zh_cn: 资源树

source: The Resources Menu
zh_cn: 资源菜单

source: The Run Menu
zh_cn: 运行菜单

source: The Scripts Menu
zh_cn: 脚本菜单

source: The Tizen target module has certain pre-requisites that must be met before being used, the most important of these is that you must have installed the Tizen SDK (available You can get the SDK here).
zh_cn: Tizen 模块具有一定的先决条件，其中最重要的是必须安装Tizen SDK (点击 这里 获取 SDK)。

source: The Toolbar
zh_cn: 工具栏

source: The Window Menu
zh_cn: 窗口菜单

source: The Windows Phone module permits you to target those devices for your games (for Windows Surface devices, use the Windows 8 module)
zh_cn: Windows Phone 模块允许您发布您的游戏到WP设备上 (Windows Surface 设备需使用 Windows 8模块)

source: The Workspace
zh_cn: 工作区

source: The YYC is really a number of separate modules, one for each available target, and will be made available to you when you get any supported target module.
zh_cn: 虽然 YYC 被划分为单独的模块，但实际上是由一些分离的模块组成，每一个都将适用于一个可用的目标平台。
